source/_static/diagrams/09-hook-on-stage.d2
direction: right
n0: "pre-"
n1: "stage"
n2: "post-"
n0 -> n1
n1 -> n2
